Tekla.Structures.TeklaStructuresInternal.Remoter


Tekla.Structures.TeklaStructuresInternal.Remoter.ChannelName
Name of the remoting channel to register.

Tekla.Structures.TeklaStructuresInternal.Remoter.#cctor
Constructor for Remoter

Tekla.Structures.TeklaStructuresInternal.Remoter.PublishTypes


Tekla.Structures.TeklaStructuresInternal.Remoter.GetSessionName
When multiple Tekla Structures instances are running on same virtualized
operating system, we need different channel name for each session.
Returns: The session name. For example "RDP-Tcp#47" or "Console".

Tekla.Structures.TeklaStructuresInternal.Remoter.InitializeSandBox
